In [12]:
import pandas as pd
import numpy as np

In [13]:
df = pd.read_csv("income.csv", names=["name","income"], skiprows=[0])
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [14]:
df.describe()

             income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [15]:
df.income.quantile(0)

4000.0

In [16]:
df.income.quantile(0.25,interpolation="higher")

6000

In [17]:
df.income.quantile(0.5,interpolation="higher")

7000

In [18]:
df.income.quantile(0.75)

7750.0

In [19]:
percentile_99 = df.income.quantile(0.99)
percentile_99

9400479.999999994

In [20]:
df[df.income>percentile_99]

        name    income
6  Elon Musk  10000000

In [21]:
df.income.mean()

1433928.5714285714

In [22]:
df_new = df.fillna(df.income.mean())
df_new

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [23]:
df_new = df.fillna(df.income.median())
df_new

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000